Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.ShowPartOpeningsOrRecessSymbol Property
 Defines whether to show the openings/recess symbol or not.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ShowPartOpeningsOrRecessSymbol { get; set; }
Public Property ShowPartOpeningsOrRecessSymbol As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace